app/views/bartenders/new.html.erb

<%= f.text_field :name %>
<%= f.collection_select :drink_category_id, DrinkCategory.all, :id, :name %>
<%= f.collection_check_boxes :bar_ids, Bar.all, :id, :name do |b| %>
---
SELECT "drink_categories".* FROM "drink_categories"
SELECT "bars".* FROM "bars"