app/views/drinks/new.html.erb

SELECT "drink_categories".* FROM "drink_categories"
---
    <%= f.label :drink_category %>
    <%= f.collection_select :drink_category_id, DrinkCategory.all, :id, :name %>