app/controllers/bartenders_controller.rb

  def index
    @bartenders = Bartender.all
---
SELECT "bartenders".* FROM "bartenders"

  def create
    # byebug
    @bartender = Bartender.create(bartender_params)
---
INSERT INTO "bar_bartenders" ("bar_id", "bartender_id") VALUES (?, ?)  [["bar_id", 1], ["bartender_id", 2]]
INSERT INTO "bartenders" ("name", "drink_category_id") VALUES (?, ?)  [["name", "meryl"], ["drink_category_id", 1]]