app/controllers/drinks_controller.rb

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @drink = Drink.find(params[:id])

INSERT INTO "drinks" ("name", "price", "created_at", "updated_at", "drink_category_id") VALUES (?, ?, ?, ?, ?)  [["name", "Coke"], ["price", 2], ["created_at", "2017-08-18 16:03:06.215481"], ["updated_at", "2017-08-18 16:03:06.215481"], ["drink_category_id", 1]]
---
  def create
    @drink = Drink.create(drinks_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @drink = Drink.find(params[:id])

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "drinks" SET "name" = ?, "updated_at" = ? WHERE "drinks"."id" = ?  [["name", "Vodka Sode"], ["updated_at", "2017-07-24 20:59:42.724806"], ["id", 4]]
---
  def update
    @drink = Drink.find(params[:id])
    @drink.update(drinks_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = ?  [["id", 2]]
---
  def destroy
    @drink = Drink.find(params[:id])
    @drink.destroy